In [1]:
import pandas as pd
import numpy as np

# Series

### Create a Series

In [2]:
x = pd.Series(np.random.rand(3), index= ['a', 'b', 'c'])
x

a    0.661511
b    0.441051
c    0.139237
dtype: float64

### Index

In [3]:
print(x[0])

0.6615108128588524

In [4]:
print(x['a'])

0.6615108128588524

### Slice

In [5]:
print(x[:2])

a    0.661511
b    0.441051
dtype: float64

# Data Frames

### Create a DataFrame

In [6]:
df = pd.DataFrame(x, columns = ['Column 1'])
df

   Column 1
a  0.661511
b  0.441051
c  0.139237

### Get Info

In [7]:
df.shape

(3, 1)

In [8]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [9]:
df.columns

Index(['Column 1'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column 1  3 non-null      float64
dtypes: float64(1)
memory usage: 128.0+ bytes

In [11]:
df.count()

Column 1    3
dtype: int64

### Add a Column

In [12]:
df['Column 2'] = df['Column 1'] * 3
df

   Column 1  Column 2
a  0.661511  1.984532
b  0.441051  1.323153
c  0.139237  0.417710

### Selecting

In [17]:
df.loc['a', 'Column 1'] # This funcion is label based

0.6615108128588524

In [14]:
df.iat[0, 0] #Use iat if you only need to get or set a single value

0.6615108128588524

In [15]:
df['Column 1'] # Returns a Series by columb label

a    0.661511
b    0.441051
c    0.139237
Name: Column 1, dtype: float64

In [13]:
df.iloc[0] # Select Row

Column 1    0.661511
Column 2    1.984532
Name: a, dtype: float64

In [18]:
df['Column 1'] > 0.5 # Boolean Indexing

a     True
b    False
c    False
Name: Column 1, dtype: bool

### Drop a row/column

In [19]:
df1 = df.drop('c', axis=0) #Axis 0 indicates that this is a row
df1

   Column 1  Column 2
a  0.661511  1.984532
b  0.441051  1.323153

In [20]:
df1 = df1.drop('Column 2', axis=1) # Axis 1 indicates that this is a column
df1

   Column 1
a  0.661511
b  0.441051

### Sort and Rank

In [21]:
df.sort_index()

   Column 1  Column 2
a  0.661511  1.984532
b  0.441051  1.323153
c  0.139237  0.417710

In [22]:
df.sort_values(by='Column 2')

   Column 1  Column 2
c  0.139237  0.417710
b  0.441051  1.323153
a  0.661511  1.984532

In [23]:
df.rank()

   Column 1  Column 2
a       3.0       3.0
b       2.0       2.0
c       1.0       1.0

### Statistics

In [24]:
df.describe()

       Column 1  Column 2
count  3.000000  3.000000
mean   0.413933  1.241799
std    0.262191  0.786573
min    0.139237  0.417710
25%    0.290144  0.870432
50%    0.441051  1.323153
75%    0.551281  1.653843
max    0.661511  1.984532

In [25]:
df.mean()

Column 1    0.413933
Column 2    1.241799
dtype: float64

In [26]:
df.median()

Column 1    0.441051
Column 2    1.323153
dtype: float64

In [27]:
df.min()

Column 1    0.139237
Column 2    0.417710
dtype: float64

In [28]:
df.max()

Column 1    0.661511
Column 2    1.984532
dtype: float64

In [29]:
df.idxmin()

Column 1    c
Column 2    c
dtype: object

In [30]:
df.idxmax()

Column 1    a
Column 2    a
dtype: object

In [31]:
df.sum()

Column 1    1.241799
Column 2    3.725396
dtype: float64

In [32]:
df.cumsum()

   Column 1  Column 2
a  0.661511  1.984532
b  1.102562  3.307686
c  1.241799  3.725396

### Apply functions

In [33]:
df.apply(lambda x: x + 3)

   Column 1  Column 2
a  3.661511  4.984532
b  3.441051  4.323153
c  3.139237  3.417710

### Manipulate Data from CSV

In [34]:
data = pd.read_csv('./data/penguins_size.csv')
data

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [35]:
data.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        342.000000       342.000000         342.000000   342.000000
mean          43.921930        17.151170         200.915205  4201.754386
std            5.459584         1.974793          14.061714   801.954536
min           32.100000        13.100000         172.000000  2700.000000
25%           39.225000        15.600000         190.000000  3550.000000
50%           44.450000        17.300000         197.000000  4050.000000
75%           48.500000        18.700000         213.000000  4750.000000
max           59.600000        21.500000         231.000000  6300.000000

In [36]:
data.to_csv('./data/new_file.csv')

### Load and Write data to SQL

In [ ]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

pd.read_sql('SELECT * FROM my_table;', engine)
pd.read_sql_table('my_table', engine)
pd.read_sql_query('SELECT * FROM my_table;', engine)

In [ ]:
data.to_sql('penguin_data', engine)